import 'package:intl/intl.dart';

class NotificationData {
  List Data = [
    {
      "sentAt": "${DateFormat("dd MMMM yyyy hh:mm a").format(DateTime.now())}",
      "title": "গুরুত্বপূর্ণ নোটিশ 🔔",
      "body":
          "আপনার প্রোফাইল তথ্য আপডেট করার সময় হয়েছে। দ্রুত আপডেটের জন্য অ্যাপে লগইন করুন এবং নতুন ফিচারগুলো উপভোগ করুন।",
    },
    {
      "sentAt": "${DateFormat("dd MMMM yyyy hh:mm a").format(DateTime.now())}",
      "title": "নতুন অফার এসেছে! 🎁",
      "body":
          "সীমিত সময়ের জন্য আপনার প্রিয় পণ্যগুলিতে বিশাল ছাড়! বিস্তারিত জানতে এক্ষুনি অফার বিভাগটি দেখুন।",
    },
    {
      "sentAt": "${DateFormat("dd MMMM yyyy hh:mm a").format(DateTime.now())}",
      "title": "কোর্স ফি প্রদানের শেষ তারিখ",
      "body":
          "আপনার চলতি মাসের কোর্সের ফি জমা দেওয়ার সময় প্রায় শেষ। কোনো বিলম্ব ফি এড়াতে দ্রুত পেমেন্ট করুন।",
    },
    {
      "sentAt": "${DateFormat("dd MMMM yyyy hh:mm a").format(DateTime.now())}",
      "title": "লাইভ ক্লাস শুরু হচ্ছে! 🔴",
      "body":
          "আপনার পছন্দের শিক্ষক/প্রশিক্ষক ঠিক ৫ মিনিটের মধ্যে লাইভে আসছেন। ক্লাসে যোগ দিতে প্রস্তুত হন!",
    },
    {
      "sentAt": "${DateFormat("dd MMMM yyyy hh:mm a").format(DateTime.now())}",
      "title": "অর্ডার ডেলিভারির পথে 🚚",
      "body":
          "আপনার অর্ডার (#ODR9876) সফলভাবে প্যাকেজ করা হয়েছে এবং কিছুক্ষণের মধ্যেই আপনার ঠিকানায় পৌঁছাবে।",
    },
    {
      "sentAt": "${DateFormat("dd MMMM yyyy hh:mm a").format(DateTime.now())}",
      "title": "আপনার জন্য নতুন বার্তা! 💬",
      "body":
          "আপনার ইনবক্সে একটি নতুন ব্যক্তিগত বার্তা এসেছে। সেটি দেখতে এখনই অ্যাপে প্রবেশ করুন।",
    },
    {
      "sentAt": "${DateFormat("dd MMMM yyyy hh:mm a").format(DateTime.now())}",
      "title": "সাপ্তাহিক রিপোর্ট প্রস্তুত ✅",
      "body":
          "আপনার এই সপ্তাহের কার্যকলাপের বিশদ রিপোর্ট তৈরি। দেখুন এবং আপনার অগ্রগতি ট্র্যাক করুন।",
    },
    {
      "sentAt": "${DateFormat("dd MMMM yyyy hh:mm a").format(DateTime.now())}",
      "title": "নেটওয়ার্ক রক্ষণাবেক্ষণ সতর্কতা ⚠️",
      "body":
          "আগামীকাল রাত ১২টা থেকে ২টা পর্যন্ত রক্ষণাবেক্ষণের জন্য পরিষেবা সাময়িকভাবে বন্ধ থাকতে পারে। আপনার সহযোগিতা কাম্য।",
    },
    {
      "sentAt": "${DateFormat("dd MMMM yyyy hh:mm a").format(DateTime.now())}",
      "title": "অনুস্মারক: আজকের টাস্ক",
      "body":
          "আপনার আজকের নির্ধারিত কাজগুলি এখনও শেষ করা হয়নি। অনুগ্রহ করে সেগুলিতে মনোযোগ দিন।",
    },
    {
      "sentAt": "${DateFormat("dd MMMM yyyy hh:mm a").format(DateTime.now())}",
      "title": "পাসওয়ার্ড পরিবর্তনের অনুরোধ",
      "body":
          "আপনার অ্যাকাউন্টের নিরাপত্তা নিশ্চিত করতে শীঘ্রই পাসওয়ার্ড পরিবর্তন করার পরামর্শ দেওয়া হচ্ছে।",
    },
  ];
}
